mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xr/common/mb9bf16xr.h
#define bFM_GPIO_PDOR7_P0                         *((volatile  uint8_t *)(0x42DE8380UL))
#define bFM4_GPIO_PDOR7_P0                        *((volatile  uint8_t *)(0x42DE8380UL))
#define bFM_GPIO_PDOR7_P1                         *((volatile  uint8_t *)(0x42DE8384UL))
#define bFM4_GPIO_PDOR7_P1                        *((volatile  uint8_t *)(0x42DE8384UL))
#define bFM_GPIO_PDOR7_P2                         *((volatile  uint8_t *)(0x42DE8388UL))
#define bFM4_GPIO_PDOR7_P2                        *((volatile  uint8_t *)(0x42DE8388UL))
#define bFM_GPIO_PDOR7_P3                         *((volatile  uint8_t *)(0x42DE838CUL))
#define bFM4_GPIO_PDOR7_P3                        *((volatile  uint8_t *)(0x42DE838CUL))
#define bFM_GPIO_PDOR7_P4                         *((volatile  uint8_t *)(0x42DE8390UL))
#define bFM4_GPIO_PDOR7_P4                        *((volatile  uint8_t *)(0x42DE8390UL))

#define bFM_GPIO_PDOR8_P0                         *((volatile  uint8_t *)(0x42DE8400UL))
#define bFM4_GPIO_PDOR8_P0                        *((volatile  uint8_t *)(0x42DE8400UL))
#define bFM_GPIO_PDOR8_P1                         *((volatile  uint8_t *)(0x42DE8404UL))
#define bFM4_GPIO_PDOR8_P1                        *((volatile  uint8_t *)(0x42DE8404UL))

#define bFM_GPIO_PDORE_P0                         *((volatile  uint8_t *)(0x42DE8700UL))
#define bFM4_GPIO_PDORE_P0                        *((volatile  uint8_t *)(0x42DE8700UL))
#define bFM_GPIO_PDORE_P2                         *((volatile  uint8_t *)(0x42DE8708UL))
#define bFM4_GPIO_PDORE_P2                        *((volatile  uint8_t *)(0x42DE8708UL))
#define bFM_GPIO_PDORE_P3                         *((volatile  uint8_t *)(0x42DE870CUL))
#define bFM4_GPIO_PDORE_P3                        *((volatile  uint8_t *)(0x42DE870CUL))

#define bFM_GPIO_PFR0_P0                          *((volatile  uint8_t *)(0x42DE0000UL))
#define bFM4_GPIO_PFR0_P0                         *((volatile  uint8_t *)(0x42DE0000UL))
#define bFM_GPIO_PFR0_P1                          *((volatile  uint8_t *)(0x42DE0004UL))
#define bFM4_GPIO_PFR0_P1                         *((volatile  uint8_t *)(0x42DE0004UL))
#define bFM_GPIO_PFR0_P2                          *((volatile  uint8_t *)(0x42DE0008UL))
#define bFM4_GPIO_PFR0_P2                         *((volatile  uint8_t *)(0x42DE0008UL))
#define bFM_GPIO_PFR0_P3                          *((volatile  uint8_t *)(0x42DE000CUL))
#define bFM4_GPIO_PFR0_P3                         *((volatile  uint8_t *)(0x42DE000CUL))
#define bFM_GPIO_PFR0_P4                          *((volatile  uint8_t *)(0x42DE0010UL))
#define bFM4_GPIO_PFR0_P4                         *((volatile  uint8_t *)(0x42DE0010UL))
#define bFM_GPIO_PFR0_P5                          *((volatile  uint8_t *)(0x42DE0014UL))
#define bFM4_GPIO_PFR0_P5                         *((volatile  uint8_t *)(0x42DE0014UL))
#define bFM_GPIO_PFR0_P6                          *((volatile  uint8_t *)(0x42DE0018UL))
#define bFM4_GPIO_PFR0_P6                         *((volatile  uint8_t *)(0x42DE0018UL))
#define bFM_GPIO_PFR0_P7                          *((volatile  uint8_t *)(0x42DE001CUL))
#define bFM4_GPIO_PFR0_P7                         *((volatile  uint8_t *)(0x42DE001CUL))
#define bFM_GPIO_PFR0_P8                          *((volatile  uint8_t *)(0x42DE0020UL))
#define bFM4_GPIO_PFR0_P8                         *((volatile  uint8_t *)(0x42DE0020UL))
#define bFM_GPIO_PFR0_P9                          *((volatile  uint8_t *)(0x42DE0024UL))
#define bFM4_GPIO_PFR0_P9                         *((volatile  uint8_t *)(0x42DE0024UL))
#define bFM_GPIO_PFR0_PA                          *((volatile  uint8_t *)(0x42DE0028UL))
#define bFM4_GPIO_PFR0_PA                         *((volatile  uint8_t *)(0x42DE0028UL))
#define bFM_GPIO_PFR0_PB                          *((volatile  uint8_t *)(0x42DE002CUL))
#define bFM4_GPIO_PFR0_PB                         *((volatile  uint8_t *)(0x42DE002CUL))
#define bFM_GPIO_PFR0_PC                          *((volatile  uint8_t *)(0x42DE0030UL))
#define bFM4_GPIO_PFR0_PC                         *((volatile  uint8_t *)(0x42DE0030UL))
#define bFM_GPIO_PFR0_PD                          *((volatile  uint8_t *)(0x42DE0034UL))
#define bFM4_GPIO_PFR0_PD                         *((volatile  uint8_t *)(0x42DE0034UL))
#define bFM_GPIO_PFR0_PE                          *((volatile  uint8_t *)(0x42DE0038UL))
#define bFM4_GPIO_PFR0_PE                         *((volatile  uint8_t *)(0x42DE0038UL))

#define bFM_GPIO_PFR1_P0                          *((volatile  uint8_t *)(0x42DE0080UL))
#define bFM4_GPIO_PFR1_P0                         *((volatile  uint8_t *)(0x42DE0080UL))
#define bFM_GPIO_PFR1_P1                          *((volatile  uint8_t *)(0x42DE0084UL))
#define bFM4_GPIO_PFR1_P1                         *((volatile  uint8_t *)(0x42DE0084UL))
#define bFM_GPIO_PFR1_P2                          *((volatile  uint8_t *)(0x42DE0088UL))
#define bFM4_GPIO_PFR1_P2                         *((volatile  uint8_t *)(0x42DE0088UL))
#define bFM_GPIO_PFR1_P3                          *((volatile  uint8_t *)(0x42DE008CUL))
#define bFM4_GPIO_PFR1_P3                         *((volatile  uint8_t *)(0x42DE008CUL))
#define bFM_GPIO_PFR1_P4                          *((volatile  uint8_t *)(0x42DE0090UL))
#define bFM4_GPIO_PFR1_P4                         *((volatile  uint8_t *)(0x42DE0090UL))
#define bFM_GPIO_PFR1_P5                          *((volatile  uint8_t *)(0x42DE0094UL))
#define bFM4_GPIO_PFR1_P5                         *((volatile  uint8_t *)(0x42DE0094UL))
#define bFM_GPIO_PFR1_P6                          *((volatile  uint8_t *)(0x42DE0098UL))
#define bFM4_GPIO_PFR1_P6                         *((volatile  uint8_t *)(0x42DE0098UL))
#define bFM_GPIO_PFR1_P7                          *((volatile  uint8_t *)(0x42DE009CUL))
#define bFM4_GPIO_PFR1_P7                         *((volatile  uint8_t *)(0x42DE009CUL))
#define bFM_GPIO_PFR1_P8                          *((volatile  uint8_t *)(0x42DE00A0UL))
#define bFM4_GPIO_PFR1_P8                         *((volatile  uint8_t *)(0x42DE00A0UL))
#define bFM_GPIO_PFR1_P9                          *((volatile  uint8_t *)(0x42DE00A4UL))
#define bFM4_GPIO_PFR1_P9                         *((volatile  uint8_t *)(0x42DE00A4UL))
#define bFM_GPIO_PFR1_PA                          *((volatile  uint8_t *)(0x42DE00A8UL))
#define bFM4_GPIO_PFR1_PA                         *((volatile  uint8_t *)(0x42DE00A8UL))
#define bFM_GPIO_PFR1_PB                          *((volatile  uint8_t *)(0x42DE00ACUL))
#define bFM4_GPIO_PFR1_PB                         *((volatile  uint8_t *)(0x42DE00ACUL))
#define bFM_GPIO_PFR1_PC                          *((volatile  uint8_t *)(0x42DE00B0UL))
#define bFM4_GPIO_PFR1_PC                         *((volatile  uint8_t *)(0x42DE00B0UL))
#define bFM_GPIO_PFR1_PD                          *((volatile  uint8_t *)(0x42DE00B4UL))
#define bFM4_GPIO_PFR1_PD                         *((volatile  uint8_t *)(0x42DE00B4UL))
#define bFM_GPIO_PFR1_PE                          *((volatile  uint8_t *)(0x42DE00B8UL))
#define bFM4_GPIO_PFR1_PE                         *((volatile  uint8_t *)(0x42DE00B8UL))
#define bFM_GPIO_PFR1_PF                          *((volatile  uint8_t *)(0x42DE00BCUL))
#define bFM4_GPIO_PFR1_PF                         *((volatile  uint8_t *)(0x42DE00BCUL))

